{"lastUpdated":"2026-01-09T05:59:08.5928560Z","employees":[{"name":"Libin","job":"Associate","photoUrl":"https://initiummanagement-my.sharepoint.com/:i:/g/personal/stanley_t_initium_com_au/IQBm_vd5ZuFtQYVwLz7yfDNnAUABq6Ti3XHzn6pe0aPUldY?e=Vp6dy2","information":"Libin Zhang is a highly motivated and dedicated professional with a strong commitment to making a positive impact in his field. He embarked on his career journey in August 2022 at Yunnan Shanhai Investment Group Co., Ltd. in Kunming, Yunnan Province, China, where he immersed himself in project management and business development, gaining valuable insights into strategic planning and execution.\n\nIn 2023, Libin transitioned to Initium Capital, assuming the role of an Associate and providing essential support to the distribution team. His role involves leveraging his extensive experience in marketing, cultivating relationships, and managing stakeholders to drive business growth and enhance client satisfaction. Libin’s proactive approach and ability to navigate complex challenges make him an invaluable asset to the Initium Capital team.Libin holds a Master’s degree in Management and Finance from the University of Technology, Sydney, where he honed his analytical and leadership skills. His academic background, coupled with practical industry experience, equips him with a well-rounded perspective and the expertise needed to excel in the dynamic field of finance and investment.","email":null,"linkedInUrl":null,"order":null},{"name":"Harry Kuo","job":"Associate","photoUrl":"https://api.dicebear.com/7.x/adventurer/svg?seed=Daniel","information":"Harry is an adept professional recognized for his strong foundation in financial diligence, operational excellence, and accountability in complex business environments.\n\nHarry gained significant financial oversight experience during a two-year tenure as an Accounts Cadet at Impero Constructions, a specialist in high-end residential and commercial projects. In this role, Harry was responsible for overseeing and managing the comprehensive daily financial transactions, maintaining the integrity of the general ledger, and ensuring fiscal accuracy. They executed meticulous monthly and year-end account reconciliations to mitigate discrepancies and risk. Harry also played a key role in managing the accounts receivable function for multi-million-dollar accounts, consistently ensuring timely collections and rigorous record accuracy.\n\nHarry also secured an internship at BT Financial, where he contributed to a strategic marketing campaign. This initiative had a primary focus on consumer education and awareness regarding ethical superannuation products. In this role, Harry successfully translated complex investment criteria and ethical frameworks into clear and compelling digital content to inform the public and enhance brand image.\n\nHarry holds a Bachelor of Commerce and Arts from Macquarie University, with majors in Management and Media, Technology and Law.","email":null,"linkedInUrl":null,"order":null},{"name":"Stanley Tsang","job":"Director","photoUrl":null,"information":"Stanley Tsang is a highly accomplished professional in the banking and finance industry, boasting over a decade of invaluable experience. His impressive career has seen him make significant contributions to esteemed financial institutions such as Westpac Private Bank, St George Bank, and ANZ Bank. His primary focus has consistently revolved around nurturing and managing relationships with high-net-worth clients, ensuring their accounts are expertly handled, and delivering top-notch services that guarantee their complete satisfaction. Stanley possesses expertise in the intricate realm of middle office activities, which are pivotal in providing vital support to the front office. This encompasses a wide range of responsibilities, including risk management, effective communication, and coordination, and providing comprehensive trade support.\n\nIn 2022, Stanley embarked on a new chapter in his career, taking on the role of Associate Director at Initium Capital. In this capacity, he shoulders the responsibility of overseeing all middle office activities, ensuring that the critical support functions continue to operate smoothly and efficiently. Stanley holds a Bachelor of Marketing from Macquarie University and holds RG146 accreditation.","email":null,"linkedInUrl":null,"order":null},{"name":"Will Jiang","job":"Director","photoUrl":null,"information":"Will is a seasoned finance professional with a multifaceted background in investment management, client relations, credit consultancy, and financial analysis. Over the course of his career, he has cultivated a robust skill set and a distinguished record of achievements within the financial services sector. Will served as a Customer Relationship Manager at Huang Property Group Pty Ltd which he adeptly navigated the complexities of the commercial property landscape, maintaining and cultivating mutually beneficial relationships with a substantial portfolio of over 200 existing and prospective tenants.\n\nIn 2022, Will joined Initium Capital as a Associate Director with an impact to extend the establishment of various strategic departments, encompassing lending advisory, wealth management, foreign exchange, and funds management. His adeptness in business development has been instrumental in identifying and fostering new leads, clients, and lending opportunities, thus fortifying Initium Capital’s market presence. Will holds a Master in Commerce at Sydney University majoring in Finance and International Business, additionally he holds a Certificate IV Finance and Mortgage Broking FNS40811 & Diploma of Finance and Mortgage Broking Management.","email":null,"linkedInUrl":null,"order":null},{"name":"Stephen Wilcox","job":"Associate","photoUrl":null,"information":"Stephen is a motivated and driven finance professional currently completing his Bachelor of Commerce with a major in Information Systems at UNSW. With a strong passion for financial services, real estate and advisory, he has developed a broad set of foundational skills through both academic excellence and hands-on experience across accounting, financial planning, and strategic analysis.\n\nIn 2023, he joined Pitcher Partners as a Cadet Accountant in the Business Advisory and Assurance team. There, he contributed to external audit processes, M&A advisory projects, and client reporting across diverse sectors including real estate, financial services, motor industry and retail. In 2024, he continued his career at Lorica Partners, where he demonstrated strong research capabilities in high-net-worth client solutions with an exptertise in peer fund analysis. In addition to his professional experience, Stephen has demonstrated exceptional leadership and innovation in various competitions. He co-founded Heimdall, a rip-detection software startup awarded the People’s Choice Award at the 2024 Peter Farrell Cup. He also secured top placings in case competitions run by Microsoft, KPMG, Citi Bank, and UNSW, showcasing his entrepreneurial thinking and team collaboration skills.\n\nStephen joins Initium Capital as an associate in the distribution team, applying his analytical and communication skills to drive value for investors and partners.","email":null,"linkedInUrl":null,"order":null},{"name":"Aurora Li","job":"Associate","photoUrl":null,"information":"Aurora Li is an emerging professional in the marketing and communications field, bringing cross-sector experience spanning finance, sports, and corporate organizations. She is completing her Master of Commerce (Marketing) at the University of New South Wales, following a Bachelor of International Business from the University of Newcastle, and has developed strong capabilities in digital strategy, brand development, and stakeholder engagement through her diverse roles.\n\nAurora has played an important role in strengthening Initium Capital’s marketing operations, contributing to investor-focused communication, managing the firm’s LinkedIn presence, and coordinating media exposure with leading Chinese-language financial platforms such as Australian Financial News. Her work in producing marketing materials, supporting fundraising initiatives, and ensuring consistent brand presentation reflects a highly organized and detail-oriented approach aligned with the firm’s professional standards.\n\nPrior to joining Initium Capital, Aurora supported digital engagement and brand design projects with the Newcastle Knights, where her contributions were incorporated into the club’s strategic roadmap. Across these environments, she has consistently demonstrated strong communication ability, adaptability, and professionalism, operating confidently across English, Mandarin, Cantonese, and Haka. She further gained experience in corporate marketing and client communication through her role at the Postal Savings Bank of China and has provided additional support to cultural events through her involvement with the Chongqing Youth Film Festival.","email":null,"linkedInUrl":null,"order":null}]}